Revit 2027 API
BuiltInFailures.SteelElementsFailures.SteelElementModifiersWillBeIgnoredWarn Property
 The copes and cuts (by face, with voids, by reference plane) of the element are no longer modifying the geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SteelElementModifiersWillBeIgnoredWarn { get; }
Public Shared ReadOnly Property SteelElementModifiersWillBeIgnoredWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SteelElementModifiersWillBeIgnoredWarn {
	FailureDefinitionId^ get ();
}
static member SteelElementModifiersWillBeIgnoredWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SteelElementsFailures Class
Autodesk.Revit.DB Namespace